; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v6 - type_1 ?v5 - type_3)
 	      (pred_3 ?v2 - object ?v5 - type_3)
	      (pred_4 ?v6 - type_1 ?v4 - type_2)
	      (pred_2 ?v6 - type_1 ?v2 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v6 - type_1 ?v8 ?v3 - type_3)
       :precondition (and  (pred_1 ?v6 ?v8))
       :effect (and  (pred_1 ?v6 ?v3)
		     (not (pred_1 ?v6 ?v8))))

   (:action op_2
       :parameters (?v6 - type_1 ?v7 - object ?v1 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v1) (pred_1 ?v6 ?v1) (pred_4 ?v6 ?v4))
       :effect (and (pred_2 ?v6 ?v7 ?v4)
		    (not (pred_3 ?v7 ?v1)) 
		    (not (pred_4 ?v6 ?v4))))

   (:action op_3
       :parameters (?v6 - type_1 ?v7 - object ?v1 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v4) (pred_1 ?v6 ?v1))
       :effect (and (pred_3 ?v7 ?v1)
		    (pred_4 ?v6 ?v4)
		    (not (pred_2 ?v6 ?v7 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_04 - type_1
obj_14 obj_13 obj_09 obj_10 - type_2
obj_05 obj_06 obj_02 obj_03 - type_3
obj_11 obj_07 obj_12 obj_08 - object)
(:init
(pred_1 obj_01 obj_05)
(pred_4 obj_01 obj_14)
(pred_4 obj_01 obj_13)
(pred_1 obj_04 obj_02)
(pred_4 obj_04 obj_09)
(pred_4 obj_04 obj_10)
(pred_3 obj_11 obj_06)
(pred_3 obj_07 obj_03)
(pred_3 obj_12 obj_06)
(pred_3 obj_08 obj_06)
)
(:goal
(and
(pred_3 obj_11 obj_02)
(pred_3 obj_07 obj_02)
(pred_3 obj_12 obj_03)
(pred_3 obj_08 obj_02)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_01 obj_02) (pred_1 obj_04 obj_02))))
    (always (not (and (pred_1 obj_01 obj_03) (pred_1 obj_04 obj_03))))
  )
)
)

; plan
1. (op_1 obj_01 obj_05 obj_06)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_06)
   goals met: 0 of 4
2. (op_1 obj_04 obj_02 obj_06)
   deleted: (pred_1 obj_04 obj_02)
   added: (pred_1 obj_04 obj_06)
   goals met: 0 of 4
3. (op_2 obj_01 obj_11 obj_06 obj_13)
   deleted: (pred_3 obj_11 obj_06) (pred_4 obj_01 obj_13)
   added: (pred_2 obj_01 obj_11 obj_13)
   goals met: 0 of 4
4. (op_2 obj_01 obj_08 obj_06 obj_14)
   deleted: (pred_3 obj_08 obj_06) (pred_4 obj_01 obj_14)
   added: (pred_2 obj_01 obj_08 obj_14)
   goals met: 0 of 4
5. (op_2 obj_04 obj_12 obj_06 obj_10)
   deleted: (pred_3 obj_12 obj_06) (pred_4 obj_04 obj_10)
   added: (pred_2 obj_04 obj_12 obj_10)
   goals met: 0 of 4
6. (op_1 obj_04 obj_06 obj_03)
   deleted: (pred_1 obj_04 obj_06)
   added: (pred_1 obj_04 obj_03)
   goals met: 0 of 4
7. (op_1 obj_01 obj_06 obj_02)
   deleted: (pred_1 obj_01 obj_06)
   added: (pred_1 obj_01 obj_02)
   goals met: 0 of 4
8. (op_3 obj_04 obj_12 obj_03 obj_10)
   deleted: (pred_2 obj_04 obj_12 obj_10)
   added: (pred_3 obj_12 obj_03) (pred_4 obj_04 obj_10)
   goals met: 1 of 4
9. (op_2 obj_04 obj_07 obj_03 obj_09)
   deleted: (pred_3 obj_07 obj_03) (pred_4 obj_04 obj_09)
   added: (pred_2 obj_04 obj_07 obj_09)
   goals met: 1 of 4
10. (op_3 obj_01 obj_08 obj_02 obj_14)
   deleted: (pred_2 obj_01 obj_08 obj_14)
   added: (pred_3 obj_08 obj_02) (pred_4 obj_01 obj_14)
   goals met: 2 of 4
11. (op_3 obj_01 obj_11 obj_02 obj_13)
   deleted: (pred_2 obj_01 obj_11 obj_13)
   added: (pred_3 obj_11 obj_02) (pred_4 obj_01 obj_13)
   goals met: 3 of 4
12. (op_1 obj_01 obj_02 obj_05)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_05)
   goals met: 3 of 4
13. (op_1 obj_04 obj_03 obj_02)
   deleted: (pred_1 obj_04 obj_03)
   added: (pred_1 obj_04 obj_02)
   goals met: 3 of 4
14. (op_3 obj_04 obj_07 obj_02 obj_09)
   deleted: (pred_2 obj_04 obj_07 obj_09)
   added: (pred_3 obj_07 obj_02) (pred_4 obj_04 obj_09)
   goals met: 4 of 4
